# 5. 
# Написати 2 функції. 
# Перша функція прийматиме рядок та приводитиме його до нижнього регістру. 
# Друга функція прийматиме рядок та приводитиме його до верхнього регістру.
# Головна програма має застосовувати обидві функції до списку рядків за допомогою map, для кожного з рядків, та друкувати результат.


def to_upper(s):
    s1 = ''
    for x in s:
        s1 = s1 + x.upper()
    return s1

def to_lower(s):
    s1 = ''
    for x in s:
        s1 = s1 + x.lower()
    return s1

lines = [
    'Рядок номер один',
    'Рядок номер два',
    'Рядок номер три',
    'Рядок номер чорити',
    'Рядок номер п`ять',
    'Рядок номер шість',
    'Рядок номер сім',
]



upper_lines = map(to_upper, lines)
for line in upper_lines:
    print(line)
print('----------------------------')

lower_lines = map(to_lower, lines)
for line in lower_lines:
    print(line)
print('----------------------------')


